{
  "type": "SPELL",
  "id": "animal-messenger",
  "name": "Animal Messenger",
  "url": "/spells/animal-messenger",
  "source": "PHB",
  "level": 2,
  "rarity": "UNCOMMON",
  "description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as \"a man or woman dressed in the uniform of the town guard\" or \"a red-haired dwarf wearing a pointed hat.\" You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals.\\nWhen the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell.",
  "higherLevels": "If you cast this spell using a spell slot of 3nd level or higher, the duration of the spell increases by 48 hours for each slot level above 2nd.",
  "range": {
    "type": "RANGED",
    "distance": 30
  },
  "components": {
    "verbal": true,
    "semantic": true,
    "material": true,
    "cost": "A morsel of food.",
    "goldValue": 0
  },
  "castingTime": "1 action",
  "duration": "24 hours",
  "ritual": true,
  "concentration": false,
  "damage": null,
  "save": null,
  "healing": null,
  "areaOfEffect": null,
  "school": {
    "id": "enchantment",
    "name": "Enchantment",
    "url": "/magic-schools/enchantment"
  },
  "classes": [
    {
      "id": "bard",
      "name": "Bard",
      "url": "/classes/bard"
    },
    {
      "id": "druid",
      "name": "Druid",
      "url": "/classes/druid"
    },
    {
      "id": "ranger",
      "name": "Ranger",
      "url": "/classes/ranger"
    }
  ],
  "scroll": {
    "value": 250,
    "saveDC": 13,
    "attackBonus": 5
  },
  "enchanting": {
    "minLevel": 3,
    "cost": 250,
    "days": 10
  }
}