{
  "type": "SPELL",
  "id": "dispel-evil-and-good",
  "name": "Dispel Evil and Good",
  "url": "/spells/dispel-evil-and-good",
  "source": "PHB",
  "level": 5,
  "rarity": "RARE",
  "description": "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane. For the duration, celestials, elementals, fey, fiends, and undead have disadvantage on attack rolls against you.\\nYou can end the spell early by using either of the following special functions.\\nBreak Enchantment.\\nAs your action, you touch a creature you can reach that is charmed, frightened, or possessed by a celestial, an elemental, a fey, a fiend, or an undead. The creature you touch is no longer charmed, frightened, or possessed by such creatures.\\nDismissal.\\nAs your action, make a melee spell attack against a celestial, an elemental, a fey, a fiend, or an undead you can reach. On a hit, you attempt to drive the creature back to its home plane. The creature must succeed on a charisma saving throw or be sent back to its home plane (if it isn't there already). If they aren't on their home plane, undead are sent to the Shadowfell, and fey are sent to the Feywild.",
  "range": {
    "type": "SELF",
    "distance": 0
  },
  "components": {
    "verbal": true,
    "semantic": true,
    "material": true,
    "cost": "Holy water or powdered silver and iron.",
    "goldValue": 0
  },
  "castingTime": "1 action",
  "duration": "Up to 1 minute",
  "ritual": false,
  "concentration": true,
  "damage": null,
  "save": {
    "type": "CHA",
    "onSuccess": "other",
    "onFailure": null,
    "extra": "The creature must succeed on a charisma saving throw or be sent back to its home plane (if it isn't there already)"
  },
  "healing": null,
  "areaOfEffect": null,
  "school": {
    "name": "Abjuration",
    "url": "/magic-schools/abjuration"
  },
  "classes": [
    {
      "name": "Cleric",
      "url": "/classes/cleric"
    },
    {
      "name": "Paladin",
      "url": "/classes/paladin"
    }
  ],
  "scroll": {
    "value": 5000,
    "saveDC": 17,
    "attackBonus": 9
  },
  "enchanting": {
    "minLevel": 6,
    "cost": 5000,
    "days": 200
  }
}