{
  "type": "SPELL",
  "id": "flesh-to-stone",
  "name": "Flesh to Stone",
  "url": "/spells/flesh-to-stone",
  "source": "PHB",
  "level": 6,
  "rarity": "VERY_RARE",
  "description": "You attempt to turn one creature that you can see within range into stone. If the target's body is made of flesh, the creature must make a constitution saving throw. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature isn't affected.\\nA creature restrained by this spell must make another constitution saving throw at the end of each of its turns. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to stone and subjected to the petrified condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.\\nIf the creature is physically broken while petrified, it suffers from similar deformities if it reverts to its original state.\\nIf you maintain your concentration on this spell for the entire possible duration, the creature is turned to stone until the effect is removed.",
  "range": {
    "type": "RANGED",
    "distance": 60
  },
  "components": {
    "verbal": true,
    "semantic": true,
    "material": true,
    "cost": "A pinch of lime, water, and earth.",
    "goldValue": 0
  },
  "castingTime": "1 action",
  "duration": "Up to 1 minute",
  "ritual": false,
  "concentration": true,
  "damage": null,
  "save": {
    "type": "CON",
    "onSuccess": null,
    "onFailure": "On a failed save, the target is restrained as its flesh begins to harden.",
    "extra": null
  },
  "healing": null,
  "areaOfEffect": null,
  "school": {
    "name": "Transmutation",
    "url": "/magic-schools/transmutation"
  },
  "classes": [
    {
      "name": "Warlock",
      "url": "/classes/warlock"
    },
    {
      "name": "Wizard",
      "url": "/classes/wizard"
    }
  ],
  "scroll": {
    "value": 10000,
    "saveDC": 17,
    "attackBonus": 9
  },
  "enchanting": {
    "minLevel": 11,
    "cost": 10000,
    "days": 400
  }
}