{
  "type": "SPELL",
  "id": "magic-mouth",
  "name": "Magic Mouth",
  "url": "/spells/magic-mouth",
  "source": "PHB",
  "level": 2,
  "rarity": "UNCOMMON",
  "description": "You plant a message to an object in the range of the spell. The message is verbalized when the trigger conditions are met. Choose an object that you see, and that is not worn or carried by another creature. Then say the message, which should not exceed 25 words but listening can take up to 10 minutes. Finally, establish the circumstances that trigger the spell to deliver your message.\\nWhen these conditions are satisfied, a magical mouth appears on the object and it articulates the message imitating your voice, the same tone used during implantation of the message. If the selected object has a mouth or something that approaches such as the mouth of a statue, the magic mouth come alive at this point, giving the illusion that the words come from the mouth of the object.\\nWhen you cast this spell, you may decide that the spell ends when the message is delivered or it can persist and repeat the message whenever circumstances occur.\\nThe triggering circumstance can be as general or as detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the object. For example, you could instruct the mouth to speak when any creature moves within 30 feet of the object or when a silver bell rings within 30 feet of it.",
  "range": {
    "type": "RANGED",
    "distance": 30
  },
  "components": {
    "verbal": true,
    "semantic": true,
    "material": true,
    "cost": "A honeycomb and jade dust of at least 10 inches, the spell consumes.",
    "goldValue": 0
  },
  "castingTime": "1 minute",
  "duration": "Until dispelled",
  "ritual": true,
  "concentration": false,
  "damage": null,
  "save": null,
  "healing": null,
  "areaOfEffect": null,
  "school": {
    "name": "Illusion",
    "url": "/magic-schools/illusion"
  },
  "classes": [
    {
      "name": "Bard",
      "url": "/classes/bard"
    },
    {
      "name": "Wizard",
      "url": "/classes/wizard"
    }
  ],
  "scroll": {
    "value": 250,
    "saveDC": 13,
    "attackBonus": 5
  },
  "enchanting": {
    "minLevel": 3,
    "cost": 250,
    "days": 10
  }
}