{
  "type": "SPELL",
  "id": "wall-of-ice",
  "name": "Wall of Ice",
  "url": "/spells/wall-of-ice",
  "source": "PHB",
  "level": 6,
  "rarity": "VERY_RARE",
  "description": "You create a wall of ice on a solid surface within range. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-square panels. Each panel must be contiguous with another panel. In any form, the wall is 1 foot thick and lasts for the duration.\\nIf the wall cuts through a creature's space when it appears, the creature within its area is pushed to one side of the wall and must make a dexterity saving throw. On a failed save, the creature takes 10d6 cold damage, or half as much damage on a successful save.\\nThe wall is an object that can be damaged and thus breached. It has AC 12 and 30 hit points per 10-foot section, and it is vulnerable to fire damage. Reducing a 10-foot section of wall to 0 hit points destroys it and leaves behind a sheet of frigid air in the space the wall occupied. A creature moving through the sheet of frigid air for the first time on a turn must make a constitution saving throw. That creature takes 5d6 cold damage on a failed save, or half as much damage on a successful one.",
  "higherLevels": "When you cast this spell using a spell slot of 7th level or higher, the damage the wall deals when it appears increases by 2d6, and the damage from passing through the sheet of frigid air increases by 1d6, for each slot level above 6th.",
  "range": {
    "type": "RANGED",
    "distance": 120
  },
  "components": {
    "verbal": true,
    "semantic": true,
    "material": true,
    "cost": "A small piece of quartz.",
    "goldValue": 0
  },
  "castingTime": "1 action",
  "duration": "Up to 10 minutes",
  "ritual": false,
  "concentration": true,
  "damage": {
    "type": {
      "id": "cold",
      "name": "Cold",
      "url": "/damage-types/cold"
    },
    "slotLevels": [
      "",
      "",
      "",
      "",
      "",
      "",
      "10d6",
      "12d6",
      "14d6",
      "16d6"
    ],
    "characterLevels": null
  },
  "save": {
    "type": "DEX",
    "onSuccess": "half",
    "onFailure": null,
    "extra": null
  },
  "healing": null,
  "areaOfEffect": {
    "shape": "SPHERE",
    "size": 10
  },
  "school": {
    "id": "evocation",
    "name": "Evocation",
    "url": "/magic-schools/evocation"
  },
  "classes": [
    {
      "id": "wizard",
      "name": "Wizard",
      "url": "/classes/wizard"
    }
  ],
  "scroll": {
    "value": 10000,
    "saveDC": 17,
    "attackBonus": 9
  },
  "enchanting": {
    "minLevel": 11,
    "cost": 10000,
    "days": 400
  }
}